{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Sandbox to test data fetch"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from models import *\n",
    "from neomodel import config, db\n",
    "config.DATABASE_URL = 'bolt://neo4j:WBrtpKCUW28e@44.206.130.87:7687'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neomodel.integration.pandas import to_dataframe"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [],
   "source": [
    "q='''\n",
    "MATCH (n)-[y:hasNextDomain]->(m)\n",
    "RETURN n,m,y\n",
    "LIMIT 4\n",
    "'''\n",
    "o=db.cypher_query(q,resolve_objects=True)\n",
    "\n",
    "# import pandas as pd\n",
    "df_=to_dataframe(o)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [],
   "source": [
    "q='''\n",
    "MATCH (n:FuncDomainSet {name:\"Flavi_capsid\"})-[:HasMember]->(x:FuncDomain)<-[:HasReg]-(y)\n",
    "RETURN x,y\n",
    "LIMIT 1\n",
    "'''\n",
    "o=db.cypher_query(q,resolve_objects=True)\n",
    "\n",
    "# import pandas as pd\n",
    "df_=to_dataframe(o)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'aatccggaggattccggattgtcaatatgctaaaacgcggagtagcccgtgtgagcccctttgggggcttgaagaggctgccagccggacttctgctgggtcatgggcccatcaggatggtcttggcgattctagcctttttgagattcacggcaatcaagccatcactgggtctcatcaatagatggggttcagtggggaaaaaagaggctatggaaacaataaagaagttcaagaaagatctggctgccatgctgagaataatcaatgctaggaaggagaagaagagacgaggcgcagatactagtgtcggaattgttggcctcctgctgaccacagctatggcag'"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_['x'][0].seq"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 6.5 ms, sys: 1.86 ms, total: 8.37 ms\n",
      "Wall time: 80.1 ms\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "50"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%time df_['y'][0].degree1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 103 µs, sys: 0 ns, total: 103 µs\n",
      "Wall time: 113 µs\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "50"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%time df_['y'][0].degree"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "50"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "q='''\n",
    "MATCH (n:FuncDomainSet {name:\"Flavi_capsid\"})-[:HasMember]->(x:FuncDomain)-[:HasDownstream]->()-[:HasDownstream]->(y:FuncDomain)<-[:HasMember]-(m:FuncDomainSet {name:\"Flavi_propep\"})\n",
    "RETURN count(x) as degree\n",
    "'''\n",
    "# to_dataframe(db.cypher_query(q,resolve_objects=True))\n",
    "# to_dataframe(db.cypher_query(q,resolve_objects=True))\n",
    "db.cypher_query(q,resolve_objects=False)[0][0][0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>degree</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>50</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   degree\n",
       "0      50"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "q='''\n",
    "MATCH (n:FuncDomainSet {name:\"Flavi_capsid\"})-[r]->(m:FuncDomainSet {name:\"Flavi_propep\"})\n",
    "RETURN r.degree as degree\n",
    "'''\n",
    "to_dataframe(db.cypher_query(q,resolve_objects=True))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>n</th>\n",
       "      <th>m</th>\n",
       "      <th>y</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>{'name': 'Flavi_capsid', 'source': 'Pfam', 'ac...</td>\n",
       "      <td>{'name': 'Flavi_propep', 'source': 'Pfam', 'ac...</td>\n",
       "      <td>&lt;models.HasnextdomainRel object at 0x7f22d8fa4...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>{'name': 'Flavi_propep', 'source': 'Pfam', 'ac...</td>\n",
       "      <td>{'name': 'Flavi_M', 'source': 'Pfam', 'accessi...</td>\n",
       "      <td>&lt;models.HasnextdomainRel object at 0x7f22d8f96...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>{'name': 'Flavi_propep', 'source': 'Pfam', 'ac...</td>\n",
       "      <td>{'name': 'Flavi_glycoprot', 'source': 'Pfam', ...</td>\n",
       "      <td>&lt;models.HasnextdomainRel object at 0x7f22d8f96...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>{'name': 'Flavi_M', 'source': 'Pfam', 'accessi...</td>\n",
       "      <td>{'name': 'Flavi_glycoprot', 'source': 'Pfam', ...</td>\n",
       "      <td>&lt;models.HasnextdomainRel object at 0x7f22d8f96...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>{'name': 'Flavi_glycoprot', 'source': 'Pfam', ...</td>\n",
       "      <td>{'name': 'Flavi_glycop_C', 'source': 'Pfam', '...</td>\n",
       "      <td>&lt;models.HasnextdomainRel object at 0x7f22d8f95...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>110</th>\n",
       "      <td>{'name': 'Filo_glycop', 'source': 'Pfam', 'acc...</td>\n",
       "      <td>{'name': 'Transcript_VP30', 'source': 'Pfam', ...</td>\n",
       "      <td>&lt;models.HasnextdomainRel object at 0x7f22d8e32...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>111</th>\n",
       "      <td>{'name': 'Transcript_VP30', 'source': 'Pfam', ...</td>\n",
       "      <td>{'name': 'Mononeg_RNA_pol', 'source': 'Pfam', ...</td>\n",
       "      <td>&lt;models.HasnextdomainRel object at 0x7f22d8e32...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>112</th>\n",
       "      <td>{'name': 'Transcript_VP30', 'source': 'Pfam', ...</td>\n",
       "      <td>{'name': 'Filo_VP24', 'source': 'Pfam', 'acces...</td>\n",
       "      <td>&lt;models.HasnextdomainRel object at 0x7f22d8e32...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>113</th>\n",
       "      <td>{'name': 'Filo_VP24', 'source': 'Pfam', 'acces...</td>\n",
       "      <td>{'name': 'Mononeg_RNA_pol', 'source': 'Pfam', ...</td>\n",
       "      <td>&lt;models.HasnextdomainRel object at 0x7f22d8e32...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>114</th>\n",
       "      <td>{'name': 'TLV_coat', 'source': 'Pfam', 'access...</td>\n",
       "      <td>{'name': 'Transcript_VP30', 'source': 'Pfam', ...</td>\n",
       "      <td>&lt;models.HasnextdomainRel object at 0x7f22d8e33...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>115 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                     n  \\\n",
       "0    {'name': 'Flavi_capsid', 'source': 'Pfam', 'ac...   \n",
       "1    {'name': 'Flavi_propep', 'source': 'Pfam', 'ac...   \n",
       "2    {'name': 'Flavi_propep', 'source': 'Pfam', 'ac...   \n",
       "3    {'name': 'Flavi_M', 'source': 'Pfam', 'accessi...   \n",
       "4    {'name': 'Flavi_glycoprot', 'source': 'Pfam', ...   \n",
       "..                                                 ...   \n",
       "110  {'name': 'Filo_glycop', 'source': 'Pfam', 'acc...   \n",
       "111  {'name': 'Transcript_VP30', 'source': 'Pfam', ...   \n",
       "112  {'name': 'Transcript_VP30', 'source': 'Pfam', ...   \n",
       "113  {'name': 'Filo_VP24', 'source': 'Pfam', 'acces...   \n",
       "114  {'name': 'TLV_coat', 'source': 'Pfam', 'access...   \n",
       "\n",
       "                                                     m  \\\n",
       "0    {'name': 'Flavi_propep', 'source': 'Pfam', 'ac...   \n",
       "1    {'name': 'Flavi_M', 'source': 'Pfam', 'accessi...   \n",
       "2    {'name': 'Flavi_glycoprot', 'source': 'Pfam', ...   \n",
       "3    {'name': 'Flavi_glycoprot', 'source': 'Pfam', ...   \n",
       "4    {'name': 'Flavi_glycop_C', 'source': 'Pfam', '...   \n",
       "..                                                 ...   \n",
       "110  {'name': 'Transcript_VP30', 'source': 'Pfam', ...   \n",
       "111  {'name': 'Mononeg_RNA_pol', 'source': 'Pfam', ...   \n",
       "112  {'name': 'Filo_VP24', 'source': 'Pfam', 'acces...   \n",
       "113  {'name': 'Mononeg_RNA_pol', 'source': 'Pfam', ...   \n",
       "114  {'name': 'Transcript_VP30', 'source': 'Pfam', ...   \n",
       "\n",
       "                                                     y  \n",
       "0    <models.HasnextdomainRel object at 0x7f22d8fa4...  \n",
       "1    <models.HasnextdomainRel object at 0x7f22d8f96...  \n",
       "2    <models.HasnextdomainRel object at 0x7f22d8f96...  \n",
       "3    <models.HasnextdomainRel object at 0x7f22d8f96...  \n",
       "4    <models.HasnextdomainRel object at 0x7f22d8f95...  \n",
       "..                                                 ...  \n",
       "110  <models.HasnextdomainRel object at 0x7f22d8e32...  \n",
       "111  <models.HasnextdomainRel object at 0x7f22d8e32...  \n",
       "112  <models.HasnextdomainRel object at 0x7f22d8e32...  \n",
       "113  <models.HasnextdomainRel object at 0x7f22d8e32...  \n",
       "114  <models.HasnextdomainRel object at 0x7f22d8e33...  \n",
       "\n",
       "[115 rows x 3 columns]"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def connect_domain_set():\n",
    "    with db.transaction:\n",
    "        q='''\n",
    "        MATCH (n:FuncDomainSet)-[x:hasDownstreamSet]->()-[:hasDownstreamSet]->(m:FuncDomainSet) \n",
    "        MERGE (n)-[y:hasNextDomain]->(m)\n",
    "        SET y.degree=x.degree\n",
    "        return n,m,y\n",
    "        '''\n",
    "        # MERGE (n)-[y:hasNextDomain {degree:x.degree}]->(m)\n",
    "        return db.cypher_query(q,resolve_objects=True)\n",
    "to_dataframe(connect_domain_set())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "def connect_domain_set():\n",
    "    q='''\n",
    "    MATCH (n:FuncDomainSet)-[x:hasDownstreamSet]->()-[:hasDownstreamSet]->(m:FuncDomainSet) \n",
    "    MERGE (n)-[y:hasNextDomain]->(m)\n",
    "    SET y.degree=x.degree\n",
    "    return n,m,y\n",
    "    '''\n",
    "    # MERGE (n)-[y:hasNextDomain {degree:x.degree}]->(m)\n",
    "    return db.cypher_query(q,resolve_objects=True)\n",
    "\n",
    "\n",
    "q='''\n",
    "    MATCH (n:FuncDomainSet)-[y:hasNextDomain]->(m:FuncDomainSet) \n",
    "    DELETE y\n",
    "    '''\n",
    "db.cypher_query(q)\n",
    "\n",
    "q='''\n",
    "    MATCH (n:FuncDomainSet)-[x:hasDownstreamSet]->()-[:hasDownstreamSet]->(m:FuncDomainSet) \n",
    "    MERGE (n)-[y:hasNextDomainSet]->(m)\n",
    "    SET y.degree=x.degree\n",
    "    return n,m,y\n",
    "    '''\n",
    "    # MERGE (n)-[y:hasNextDomain {degree:x.degree}]->(m)\n",
    "to_dataframe(db.cypher_query(q,resolve_objects=True))\n",
    "\n",
    "q='''\n",
    "    MATCH (n:FuncDomain)-[:HasDownstream]->(:DomainLinkage)-[:HasDownstream]->(m:FuncDomain) \n",
    "    MERGE (n)-[y:hasNextDomain]->(m)\n",
    "    SET y.begin_at=m.b-n.e\n",
    "    WITH n,m,y,\n",
    "    CASE \n",
    "        WHEN m.e > n.e THEN 0\n",
    "        ELSE  1\n",
    "    END as nested\n",
    "    SET y.nested=nested\n",
    "    RETURN n,y,m\n",
    "    '''\n",
    "    # MERGE (n)-[y:hasNextDomain {degree:x.degree}]->(m)\n",
    "to_dataframe(db.cypher_query(q,resolve_objects=True))"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
